[
  {
    "riddle": "What is so fragile that saying its name breaks it?",
    "answer": "silence"
  },
  {
    "riddle": "What can run but never walks, has a mouth but never talks, has a head but never weeps, has a bed but never sleeps?",
    "answer": "river"
  },
  {
    "riddle": "What can fill a room but takes up no space?",
    "answer": "light"
  },
  {
    "riddle": "If you drop me I’m sure to crack, but give me a smile and I’ll always smile back. What am I?",
    "answer": "mirror"
  },
  {
    "riddle": "The more you take, the more you leave behind. What are they?",
    "answer": "footsteps"
  },
  {
    "riddle": "I turn once, what is out will not get in. I turn again, what is in will not get out. What am I?",
    "answer": "key"
  },
  {
    "riddle": "People make me, save me, change me, raise me. What am I?",
    "answer": "money"
  },
  {
    "riddle": "What breaks yet never falls, and what falls yet never breaks?",
    "answer": "day and night"
  },
  {
    "riddle": "What goes through cities and fields, but never moves?",
    "answer": "road"
  },
  {
    "riddle": "I am always hungry and will die if not fed, but whatever I touch will soon turn red. What am I?",
    "answer": "fire"
  },
  {
    "riddle": "The person who makes it has no need of it; the person who buys it has no use for it. The person who uses it can neither see nor feel it. What is it?",
    "answer": "coffin"
  },
  {
    "riddle": "A man looks at a painting and says, “Brothers and sisters I have none, but that man’s father is my father’s son.” Who is the man in the painting?",
    "answer": "his son"
  },
  {
    "riddle": "I have lakes with no water, mountains with no stone and cities with no buildings. What am I?",
    "answer": "map"
  },
  {
    "riddle": "What does man love more than life, hate more than death, or mortal strife? That which contented men desire, the poor have, the rich require, the miser spends, the spendthrift saves, and all men carry to their graves?",
    "answer": "nothing"
  },
  {
    "riddle": "A man dies of old age on his 25th birthday. How is this possible?",
    "answer": "he was born on february 29"
  },
  {
    "riddle": "I have branches, but no fruit, trunk or leaves. What am I?",
    "answer": "bank"
  },
  {
    "riddle": "What can’t talk but will reply when spoken to?",
    "answer": "echo"
  },
  {
    "riddle": "The more of this there is, the less you see. What is it?",
    "answer": "darkness"
  },
  {
    "riddle": "What goes up but never comes down?",
    "answer": "your age"
  },
  {
    "riddle": "I shave every day, but my beard stays the same. What am I?",
    "answer": "barber"
  },
  {
    "riddle": "You see a boat filled with people, yet there isn’t a single person on board. How is that possible?",
    "answer": "they are all married"
  },
  {
    "riddle": "You walk into a room that contains a match, a kerosene lamp, a candle and a fireplace. Which do you light first?",
    "answer": "match"
  },
  {
    "riddle": "I am an odd number. Take away one letter and I become even. What number am I?",
    "answer": "seven"
  },
  {
    "riddle": "What gets wet while drying?",
    "answer": "towel"
  },
  {
    "riddle": "I am always in front of you but can’t be seen. What am I?",
    "answer": "future"
  },
  {
    "riddle": "What can you break, even if you never pick it up or touch it?",
    "answer": "promise"
  },
  {
    "riddle": "A man who was outside in the rain without an umbrella or hat didn’t get a single hair on his head wet. Why?",
    "answer": "bald"
  },
  {
    "riddle": "What belongs to you, but other people use it more than you do?",
    "answer": "your name"
  },
  {
    "riddle": "What kind of band never plays music?",
    "answer": "rubber band"
  },
  {
    "riddle": "What gets bigger the more you take away?",
    "answer": "hole"
  },
  {
    "riddle": "What goes up and down but doesn’t move?",
    "answer": "staircase"
  },
  {
    "riddle": "What has one eye but can’t see?",
    "answer": "needle"
  },
  {
    "riddle": "What has many needles, but doesn’t sew?",
    "answer": "christmas tree"
  },
  {
    "riddle": "What has hands, but can’t clap?",
    "answer": "clock"
  },
  {
    "riddle": "What has words, but never speaks?",
    "answer": "book"
  },
  {
    "riddle": "What runs all around a backyard, yet never moves?",
    "answer": "fence"
  },
  {
    "riddle": "What can travel the world while staying in a corner?",
    "answer": "stamp"
  },
  {
    "riddle": "What has a thumb and four fingers, but is not a hand?",
    "answer": "glove"
  },
  {
    "riddle": "What has a head and a tail but no body?",
    "answer": "coin"
  },
  {
    "riddle": "What building has the most stories?",
    "answer": "library"
  },
  {
    "riddle": "What tastes better than it smells?",
    "answer": "your tongue"
  },
  {
    "riddle": "What has 13 hearts, but no other organs?",
    "answer": "deck of cards"
  },
  {
    "riddle": "It stalks the countryside with ears that can’t hear. What is it?",
    "answer": "corn"
  },
  {
    "riddle": "What kind of coat is best put on wet?",
    "answer": "coat of paint"
  },
  {
    "riddle": "What has a bottom at the top?",
    "answer": "your legs"
  },
  {
    "riddle": "What has four wheels and flies?",
    "answer": "garbage truck"
  },
  {
    "riddle": "A word I know, six letters it contains. Remove one letter and 12 remains. What is it?",
    "answer": "dozens"
  },
  {
    "riddle": "What has a head, one foot, and four legs?",
    "answer": "bed"
  },
  {
    "riddle": "I am a word that begins with 'i'. If you add the letter 'a' to me, I become a new word with a different meaning, but the same pronunciation. What word am I?",
    "answer": "isle"
  },
  {
    "riddle": "Mississippi has four S’s and four I’s. Can you spell that without using S or I?",
    "answer": "T-H-A-T!"
  },
  {
    "riddle": "There’s a one-story house where everything is yellow. The walls are yellow. The doors are yellow. All the furniture is yellow. The house has yellow beds and yellow couches. What color are the stairs?",
    "answer": "There are no stairs—it’s a one-story house!"
  },
  {
    "riddle": "A girl fell off a 20-foot ladder. She wasn’t hurt. How?",
    "answer": "She fell off the bottom step."
  },
  {
    "riddle": "Grandpa went out for a walk, and it started to rain. He didn’t bring an umbrella or a hat. His clothes got soaked, but not a hair on his head was wet. How is this possible?",
    "answer": "Grandpa’s bald!"
  },
  {
    "riddle": "You’re in a race and you pass the person in second place. What place are you in now?",
    "answer": "Second place."
  },
  {
    "riddle": "What four-letter word can be written forward, backward or upside down, and can still be read from left to right?",
    "answer": "NOON."
  },
  {
    "riddle": "What is at the end of the rainbow?",
    "answer": "The letter W!"
  },
  {
    "riddle": "Name three consecutive days without naming any of the seven days of the week.",
    "answer": "Yesterday, today and tomorrow."
  },
  {
    "riddle": "You are in a dark room with a box of matches. On a table are a candle, an oil lamp and a log of firewood. What do you light first?",
    "answer": "The match! Can’t light any of those things without a lit match."
  },
  {
    "riddle": "Two people were playing chess. They both won. How is this possible?",
    "answer": "They were playing two different games, against other opponents."
  },
  {
    "riddle": "What word is always spelled wrong?",
    "answer": "“Wrong.” Well, if you want to get technical, it’s not always spelled W-R-O-N-G … if you spell it wrong! So then, is it still spelled wrong? Phew! Short riddles can still make you think a whole lot."
  },
  {
    "riddle": "Which letter of the alphabet has the most water?",
    "answer": "The “C.”"
  },
  {
    "riddle": "Now see if you can solve this tricky “How many letters are in the alphabet?” riddle.",
    "answer": ""
  },
  {
    "riddle": "What invention lets you look right through a wall?",
    "answer": "A window!"
  },
  {
    "riddle": "Where does today come before yesterday?",
    "answer": "In the dictionary."
  },
  {
    "riddle": "Three doctors all say Robert is their brother. Robert says he has no brothers. Who is lying?",
    "answer": "No one—the doctors are Robert’s sisters."
  },
  {
    "riddle": "What kind of ship has two mates but no captain?",
    "answer": "A relationship."
  },
  {
    "riddle": "A man is holding exactly $5.25 but only has one coin. How is this possible?",
    "answer": "He has a quarter and a $5 bill."
  },
  {
    "riddle": "I called my dog from the opposite side of the river. The dog crossed the river without getting wet, and without using a bridge, a boat or a raft. How is that possible?",
    "answer": "frozen."
  },
  {
    "riddle": "What two words, added together, contain the most letters?",
    "answer": "Post office."
  },
  {
    "riddle": "What has a bottom at the top?",
    "answer": "Your legs."
  },
  {
    "riddle": "If you drop a yellow hat in the Red Sea, what does it become?",
    "answer": "Wet."
  },
  {
    "riddle": "What color is the wind?",
    "answer": "Blew."
  },
  {
    "riddle": "What tastes better than it smells?",
    "answer": "Your tongue."
  },
  {
    "riddle": "What can jump higher than a building?",
    "answer": "Anything that can jump—buildings can’t jump!"
  },
  {
    "riddle": "Which word becomes shorter when you add two letters to it?",
    "answer": "“Short.”"
  },
  {
    "riddle": "What has four wheels and flies?",
    "answer": "A garbage truck."
  },
  {
    "riddle": "A monkey, a squirrel and a bird are racing to the top of a coconut tree. Who will get the banana first?",
    "answer": "None"
  },
  {
    "riddle": "I can be cracked, I can be made. I can be told, I can be played. What am I?",
    "answer": "A joke."
  }
]
